demo/artillery/UseKnowledge.yml
config:
  target: 'http://35.234.80.55'
  phases:
    - duration: 600
      arrivalRate: 6
    - duration: 120
      arrivalRate: 6
      rampTo: 20
    - duration: 600
      arrivalRate: 20
    - duration: 120
      arrivalRate: 20
      rampTo: 6
    - duration: 600
      arrivalRate: 6
scenarios:
  - flow:
    - get:
        url: "/"