demo/artillery/gitlab_complete.yml
config:
  target: 'https://gitlab.groterooieknop.nl'
  http:
    pool: 5
  phases:
    - duration: 600
      arrivalRate: 20
scenarios:
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/commits/%{COMMIT_SHA}
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/deploy_keys
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/commits/%{COMMIT_SHA}/diff
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/branches/%{BRANCH_NAME}
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/commits
  - flow:
    - get:
        url: /api/v4/groups/%{GROUP_ID}/projects
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/files/%{FILE_PATH}?ref=master
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/files/%{FILE_PATH}/raw?ref=master
  - flow:
    - get:
        url: /api/v4/projects
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/merge_requests/%{MR_IID}/notes
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/tree
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/branches
  - flow:
    - get:
        url: /%{TEST_GROUP}/gitlabhq.git/info/refs?service=git-upload-pack
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/merge_requests/%{MR_IID}
  - flow:
    - get:
        url: /%{TEST_GROUP}/gitlabhq/refs/master/logs_tree
  - flow:
    - get:
        url: /%{TEST_GROUP}/gitlabhq/blob/master/app/models/project.rb
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/repository/commits/%{SIGNED_COMMIT_SHA}/signature
  - flow:
    - get:
        url: /api/v4/projects/%{PROJECT_ID}/pipelines
  - flow:
    - get:
        url: /%{TEST_GROUP}/gitlabhq/merge_requests/%{MR_IID_MANY_COMMITS}
  - flow:
    - get:
        url: /%{TEST_GROUP}/gitlabhq/merge_requests/%{MR_IID_MANY_COMMITS}/diffs.json